name: "image_classifier"
backend: "onnxruntime"
max_batch_size: 32

input [
  {
    name: "input_image"
    data_type: TYPE_FP32
    dims: [128, 128, 3]
  }
]

output [
  {
    name: "Identity:0"
    data_type: TYPE_FP32
    dims: [3]
  }
]

# Dynamic Batching collects individual requests into larger batches.
dynamic_batching {
  preferred_batch_size: [4, 8, 16]
  max_queue_delay_microseconds: 100000
}

instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
